[
  { "id": "1", "question": "How has South Korea’s crypto-friendly regulation impacted its stock market performance in H1 2025?" },
  { "id": "2", "question": "What implications do London-listed companies investing in Bitcoin have for European crypto adoption?" },
  { "id": "3", "question": "How has Robinhood’s expansion into crypto trading affected retail investor behavior?" },
  { "id": "4", "question": "What is the significance of ProCap Financial’s $1 billion merger to form a Bitcoin treasury company?" },
  { "id": "5", "question": "In what ways could including crypto assets in mortgage underwriting change housing finance?" },
  { "id": "6", "question": "How will Fiserv’s launch of FIUSD affect regional banks’ use of stablecoins?" },
  { "id": "7", "question": "What are potential risks and benefits of the GENIUS Act regulating stablecoins?" },
  { "id": "8", "question": "How might the upcoming $40 billion Bitcoin options expiry impact market volatility?" },
  { "id": "9", "question": "What major takeaways emerged from Consensus 2025 in Toronto?" },
  { "id": "10", "question": "What top crypto trends are shaping the second half of 2025?" },
  { "id": "11", "question": "How could AI-powered tokens influence the future of the crypto industry?" },
  { "id": "12", "question": "What effects might Canada’s Blockchain Futurist Conference have on North American blockchain development?" },
  { "id": "13", "question": "How is improving US stablecoin regulation expected to affect institutional Bitcoin prices?" },
  { "id": "14", "question": "What were the main drivers behind Bitcoin’s price surge past $110K in mid‑2025?" },
  { "id": "15", "question": "How could Hong Kong’s proposed stablecoin licensing shape Asia’s digital asset landscape?" },
  { "id": "16", "question": "What factors contributed to the global stock market crash in April 2025?" },
  { "id": "17", "question": "How does Trump’s Strategic Bitcoin Reserve Executive Order change national digital asset strategy?" },
  { "id": "18", "question": "What lessons were learned from Argentina’s LIBRA scandal earlier this year?" },
  { "id": "19", "question": "How will Circle’s IPO influence regulatory clarity in the US stablecoin space?" },
  { "id": "20", "question": "What impact does Europe’s MiCA framework have on crypto exchanges and service providers?" },
  { "id": "21", "question": "How has the US SEC’s approval of multiple Bitcoin ETFs affected market sentiment?" },
  { "id": "22", "question": "What are the long-term implications of Grayscale’s transition to a spot Bitcoin ETF?" },
  { "id": "23", "question": "How might India’s evolving stance on crypto taxation affect global markets?" },
  { "id": "24", "question": "What are the emerging trends in DeFi yields following major protocol hacks?" },
  { "id": "25", "question": "How did Binance’s revised compliance policy influence Asian trading volumes?" },
  { "id": "26", "question": "What role do central bank digital currencies (CBDCs) play in global finance in 2025?" },
  { "id": "27", "question": "How has Ethereum's Shanghai upgrade influenced staking behavior?" },
  { "id": "28", "question": "What are the consequences of the Terra Classic rebranding effort?" },
  { "id": "29", "question": "How could SEC's lawsuit against Coinbase shape future crypto regulation?" },
  { "id": "30", "question": "What is the impact of El Salvador’s Bitcoin bond issuance on its economy?" },
  { "id": "31", "question": "How have NFT infrastructure upgrades affected digital art markets?" },
  { "id": "32", "question": "What are the uses of tokenized real-world assets in financial portfolios?" },
  { "id": "33", "question": "How might CME’s introduction of Bitcoin micro futures affect retail trading?" },
  { "id": "34", "question": "What trends are emerging in crypto custody solutions for institutions?" },
  { "id": "35", "question": "How has BlackRock’s entry into crypto custody changed the competitive landscape?" },
  { "id": "36", "question": "What are investor behaviors after crypto crosses new all-time highs in 2025?" },
  { "id": "37", "question": "How are DeFi protocols mitigating risk after major flash loan exploits?" },
  { "id": "38", "question": "What influence do celebrity-backed tokens have on retail crypto engagement?" },
  { "id": "39", "question": "How could the collapse of a major stablecoin issuer affect global markets?" },
  { "id": "40", "question": "What impact does ESG integration have in crypto investment strategies?" },
  { "id": "41", "question": "How is token-gated content reshaping subscription services?" },
  { "id": "42", "question": "What emerging crypto crime trends are influencing regulation?" },
  { "id": "43", "question": "How have Layer 2 scaling solutions affected Ethereum’s transaction fees?" },
  { "id": "44", "question": "What is the economic effect of increased institutional adoption of crypto?" },
  { "id": "45", "question": "How have major global banks adapted to crypto asset demand?" },
  { "id": "46", "question": "What risks do OTC crypto desks pose to financial stability?" },
  { "id": "47", "question": "How did the Bitcoin halving event impact miner profitability in 2025?" },
  { "id": "48", "question": "What effects have US inflation data had on crypto correlation with equities?" },
  { "id": "49", "question": "How have upcoming interest rate decisions impacted crypto markets?" },
  { "id": "50", "question": "What are implications of cross-chain interoperability protocols on DeFi?" },
  { "id": "51", "question": "How has the collapse of a major crypto bank influenced regulatory reform?" },
  { "id": "52", "question": "What impact did Worldcoin’s identity token rollout have on user adoption rates?" },
  { "id": "53", "question": "How are tokenized mortgages changing real estate financing?" },
  { "id": "54", "question": "What are the risks of algorithmic stablecoins after recent failures?" },
  { "id": "55", "question": "How did the SEC vs Ripple ruling reshape XRP’s price trajectory?" },
  { "id": "56", "question": "What trends are emerging in crypto derivatives volume post-ETF frenzy?" },
  { "id": "57", "question": "How are decentralized autonomous organizations (DAOs) evolving governance models?" },
  { "id": "58", "question": "What is the role of blockchain analytics in preventing fraud?" },
  { "id": "59", "question": "How are climate-related disclosures influencing crypto firms?" },
  { "id": "60", "question": "What are the implications of staking regulation in the US?" },
  { "id": "61", "question": "How have gas fee optimizations impacted smart contract execution?" },
  { "id": "62", "question": "What opportunities arise from tokenizing fine art on-chain?" },
  { "id": "63", "question": "How does crypto lending regulation vary across major jurisdictions?" },
  { "id": "64", "question": "What is the impact of token burns on coin supply dynamics?" },
  { "id": "65", "question": "How are crypto credit cards influencing consumer spending?" },
  { "id": "66", "question": "What are institutional approaches to managing crypto custody risk?" },
  { "id": "67", "question": "How could a major altcoin’s protocol upgrade shift investor confidence?" },
  { "id": "68", "question": "What effect do stablecoin reserve audits have on market trust?" },
  { "id": "69", "question": "How has on-chain data analysis improved risk assessment in DeFi?" },
  { "id": "70", "question": "What is the outlook for tokenized bonds in 2025?" },
  { "id": "71", "question": "How does financial crime risk change with increased crypto adoption?" },
  { "id": "72", "question": "What will be the impact of programmable money on global remittances?" },
  { "id": "73", "question": "How do privacy-focused blockchains affect regulatory compliance?" },
  { "id": "74", "question": "What challenges do NFTs face in mainstream financial ecosystems?" },
  { "id": "75", "question": "How might crypto taxation clarity influence user onboarding?" },
  { "id": "76", "question": "What is the role of on-chain governance in future financial markets?" },
  { "id": "77", "question": "How are global central banks responding to crypto-driven capital flows?" },
  { "id": "78", "question": "What are the economic consequences of stablecoin de-pegging incidents?" },
  { "id": "79", "question": "How is fractionalized real estate on-chain affecting investor access?" },
  { "id": "80", "question": "What are the trends in institutional crypto portfolio diversification?" },
  { "id": "81", "question": "How is the tokenization of commodities influencing trading strategies?" },
  { "id": "82", "question": "What frameworks exist to evaluate crypto project ESG performance?" },
  { "id": "83", "question": "How have Layer 1 competitive dynamics influenced crypto valuations?" },
  { "id": "84", "question": "What role do crypto research firms play in market transparency?" },
  { "id": "85", "question": "How did macroeconomic data in Q2 2025 influence BTC correlation?" },
  { "id": "86", "question": "What are the implications of cross-border stablecoin adoption?" },
  { "id": "87", "question": "How could tokenized private equity change wealth management?" },
  { "id": "88", "question": "What strategies exist for mitigating smart contract exploits?" },
  { "id": "89", "question": "How is real-time settlement via blockchain impacting payments?" },
  { "id": "90", "question": "What is the outlook for crypto market liquidity heading into 2026?" },
  { "id": "91", "question": "How are flash loans influencing yield strategies in DeFi?" },
  { "id": "92", "question": "What regulatory changes are expected following the FTX collapse anniversary?" },
  { "id": "93", "question": "How have token issuer disclosures changed since MiCAR in Europe?" },
  { "id": "94", "question": "What innovations are emerging in on-chain identity verification?" },
  { "id": "95", "question": "How could quantum computing threats reshape crypto security?" },
  { "id": "96", "question": "What role will digital asset indices play in portfolio construction?" },
  { "id": "97", "question": "How is crowd-sourced insurance in DeFi evolving risk models?" },
  { "id": "98", "question": "What are the emerging use cases for crypto in supply chain finance?" },
  { "id": "99", "question": "How can tokenized carbon credits support sustainability efforts?" },
  { "id": "100", "question": "What lessons from 2025 will shape crypto regulation in 2026?" }
]
