{
  "1": "What is Python and what are its key features?",
  "2": "How do you install Python on different operating systems?",
  "3": "What are Python's data types and how are they used?",
  "4": "What is the difference between a list and a tuple in Python?",
  "5": "How do you write conditional statements in Python?",
  "6": "What are loops in Python and how do you use for and while loops?",
  "7": "What are functions in Python and how do you define them?",
  "8": "What is the difference between global and local variables in Python?",
  "9": "How do you handle exceptions in Python using try, except blocks?",
  "10": "What are Python modules and how do you import them?",
  "11": "How do you create and use classes in Python?",
  "12": "What is inheritance in Python and how does it work?",
  "13": "What are Python decorators and how are they used?",
  "14": "What is the purpose of the __init__ method?",
  "15": "How does Python handle memory management?",
  "16": "What is the difference between is and == in Python?",
  "17": "What is a lambda function and when should you use it?",
  "18": "What is list comprehension in Python?",
  "19": "How do you use dictionaries and sets in Python?",
  "20": "What is the difference between shallow and deep copy?",
  "21": "What are Python generators and how do they work?",
  "22": "What is the yield keyword used for?",
  "23": "What is a context manager and how is it implemented?",
  "24": "What is the purpose of the with statement in Python?",
  "25": "How do you handle file operations in Python?",
  "26": "How do you read and write CSV files using Python?",
  "27": "What is the difference between binary and text file handling?",
  "28": "What are some common Python libraries and their use cases?",
  "29": "What is virtualenv and why is it useful?",
  "30": "How do you manage dependencies using pip?",
  "31": "What is PEP 8 and why is it important?",
  "32": "What are Python docstrings and how are they used?",
  "33": "How do you write unit tests in Python?",
  "34": "What is the unittest module and how do you use it?",
  "35": "How do you mock objects in tests?",
  "36": "What is pytest and how is it different from unittest?",
  "37": "How do you debug Python code effectively?",
  "38": "What is logging and how is it configured in Python?",
  "39": "What are assertions in Python and how do they help?",
  "40": "What is recursion and how do you implement it in Python?",
  "41": "What are some common recursion pitfalls in Python?",
  "42": "What is a Python iterator and how do you create one?",
  "43": "How does Python implement garbage collection?",
  "44": "What is the global interpreter lock (GIL)?",
  "45": "How do you use multithreading in Python?",
  "46": "How is multiprocessing different from multithreading?",
  "47": "What are coroutines in Python?",
  "48": "How do you use async and await in Python?",
  "49": "What is asyncio and when should it be used?",
  "50": "How do you handle JSON data in Python?"
}
